node {
  input: "33"
  input: "1"
  input: "2"
  output: "34"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "34"
  output: "35"
  op_type: "Relu"
}
node {
  input: "35"
  input: "3"
  input: "4"
  output: "36"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "36"
  output: "37"
  op_type: "Relu"
}
node {
  input: "37"
  output: "38"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "38"
  input: "5"
  input: "6"
  output: "39"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "39"
  output: "40"
  op_type: "Relu"
}
node {
  input: "40"
  input: "7"
  input: "8"
  output: "41"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "41"
  output: "42"
  op_type: "Relu"
}
node {
  input: "42"
  output: "43"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "43"
  input: "9"
  input: "10"
  output: "44"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "44"
  output: "45"
  op_type: "Relu"
}
node {
  input: "45"
  input: "11"
  input: "12"
  output: "46"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "46"
  output: "47"
  op_type: "Relu"
}
node {
  input: "47"
  input: "13"
  input: "14"
  output: "48"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "48"
  output: "49"
  op_type: "Relu"
}
node {
  input: "49"
  output: "50"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "50"
  input: "15"
  input: "16"
  output: "51"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "51"
  output: "52"
  op_type: "Relu"
}
node {
  input: "52"
  input: "17"
  input: "18"
  output: "53"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "53"
  output: "54"
  op_type: "Relu"
}
node {
  input: "54"
  input: "19"
  input: "20"
  output: "55"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "55"
  output: "56"
  op_type: "Relu"
}
node {
  input: "56"
  output: "57"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "57"
  input: "21"
  input: "22"
  output: "58"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "58"
  output: "59"
  op_type: "Relu"
}
node {
  input: "59"
  input: "23"
  input: "24"
  output: "60"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "60"
  output: "61"
  op_type: "Relu"
}
node {
  input: "61"
  input: "25"
  input: "26"
  output: "62"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "62"
  output: "63"
  op_type: "Relu"
}
node {
  input: "63"
  output: "64"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "64"
  output: "66"
  output: "67"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: -1
  }
}
node {
  input: "27"
  output: "68"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "66"
  input: "68"
  input: "28"
  output: "69"
  op_type: "FC"
}
node {
  input: "69"
  output: "70"
  op_type: "Relu"
}
node {
  input: "70"
  output: "72"
  output: "73"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "29"
  output: "74"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "72"
  input: "74"
  input: "30"
  output: "75"
  op_type: "FC"
}
node {
  input: "75"
  output: "76"
  op_type: "Relu"
}
node {
  input: "76"
  output: "78"
  output: "79"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "31"
  output: "80"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "78"
  input: "80"
  input: "32"
  output: "81"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
output: "81"
