node {
  input: "39"
  input: "1"
  input: "2"
  output: "41"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "41"
  output: "44"
  op_type: "Relu"
}
node {
  input: "44"
  input: "3"
  input: "4"
  output: "47"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "47"
  output: "50"
  op_type: "Relu"
}
node {
  input: "50"
  output: "53"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "53"
  input: "5"
  input: "6"
  output: "57"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "57"
  output: "60"
  op_type: "Relu"
}
node {
  input: "60"
  input: "7"
  input: "8"
  output: "63"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "63"
  output: "66"
  op_type: "Relu"
}
node {
  input: "66"
  output: "69"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "69"
  input: "9"
  input: "10"
  output: "73"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "73"
  output: "76"
  op_type: "Relu"
}
node {
  input: "76"
  input: "11"
  input: "12"
  output: "79"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "79"
  output: "82"
  op_type: "Relu"
}
node {
  input: "82"
  input: "13"
  input: "14"
  output: "85"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "85"
  output: "88"
  op_type: "Relu"
}
node {
  input: "88"
  input: "15"
  input: "16"
  output: "91"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "91"
  output: "94"
  op_type: "Relu"
}
node {
  input: "94"
  output: "97"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "97"
  input: "17"
  input: "18"
  output: "101"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "101"
  output: "104"
  op_type: "Relu"
}
node {
  input: "104"
  input: "19"
  input: "20"
  output: "107"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "107"
  output: "110"
  op_type: "Relu"
}
node {
  input: "110"
  input: "21"
  input: "22"
  output: "113"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "113"
  output: "116"
  op_type: "Relu"
}
node {
  input: "116"
  input: "23"
  input: "24"
  output: "119"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "119"
  output: "122"
  op_type: "Relu"
}
node {
  input: "122"
  output: "125"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "125"
  input: "25"
  input: "26"
  output: "129"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "129"
  output: "132"
  op_type: "Relu"
}
node {
  input: "132"
  input: "27"
  input: "28"
  output: "135"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "135"
  output: "138"
  op_type: "Relu"
}
node {
  input: "138"
  input: "29"
  input: "30"
  output: "141"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "141"
  output: "144"
  op_type: "Relu"
}
node {
  input: "144"
  input: "31"
  input: "32"
  output: "147"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "147"
  output: "150"
  op_type: "Relu"
}
node {
  input: "150"
  output: "153"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "153"
  output: "157"
  output: "tmp0"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: -1
  }
}
node {
  input: "33"
  output: "160"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "157"
  input: "160"
  input: "34"
  output: "163"
  op_type: "FC"
}
node {
  input: "163"
  output: "166"
  op_type: "Relu"
}
node {
  input: "166"
  output: "169"
  output: "tmp1"
  op_type: "Dropout"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "ratio"
    f: 0.5
  }
}
node {
  input: "35"
  output: "172"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "169"
  input: "172"
  input: "36"
  output: "175"
  op_type: "FC"
}
node {
  input: "175"
  output: "178"
  op_type: "Relu"
}
node {
  input: "178"
  output: "181"
  output: "tmp2"
  op_type: "Dropout"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "ratio"
    f: 0.5
  }
}
node {
  input: "37"
  output: "184"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "181"
  input: "184"
  input: "38"
  output: "187"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
input: "34"
input: "35"
input: "36"
input: "37"
input: "38"
input: "39"
output: "187"
