node {
  input: "33"
  input: "1"
  input: "2"
  output: "34"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "34"
  output: "36"
  op_type: "Relu"
}
node {
  input: "36"
  input: "3"
  input: "4"
  output: "38"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "38"
  output: "40"
  op_type: "Relu"
}
node {
  input: "40"
  output: "42"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "42"
  input: "5"
  input: "6"
  output: "45"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "45"
  output: "47"
  op_type: "Relu"
}
node {
  input: "47"
  input: "7"
  input: "8"
  output: "49"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "49"
  output: "51"
  op_type: "Relu"
}
node {
  input: "51"
  output: "53"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "53"
  input: "9"
  input: "10"
  output: "56"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "56"
  output: "58"
  op_type: "Relu"
}
node {
  input: "58"
  input: "11"
  input: "12"
  output: "60"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "60"
  output: "62"
  op_type: "Relu"
}
node {
  input: "62"
  input: "13"
  input: "14"
  output: "64"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "64"
  output: "66"
  op_type: "Relu"
}
node {
  input: "66"
  output: "68"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "68"
  input: "15"
  input: "16"
  output: "71"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "71"
  output: "73"
  op_type: "Relu"
}
node {
  input: "73"
  input: "17"
  input: "18"
  output: "75"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "75"
  output: "77"
  op_type: "Relu"
}
node {
  input: "77"
  input: "19"
  input: "20"
  output: "79"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "79"
  output: "81"
  op_type: "Relu"
}
node {
  input: "81"
  output: "83"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "83"
  input: "21"
  input: "22"
  output: "86"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "86"
  output: "88"
  op_type: "Relu"
}
node {
  input: "88"
  input: "23"
  input: "24"
  output: "90"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "90"
  output: "92"
  op_type: "Relu"
}
node {
  input: "92"
  input: "25"
  input: "26"
  output: "94"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "94"
  output: "96"
  op_type: "Relu"
}
node {
  input: "96"
  output: "98"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "98"
  output: "102"
  output: "103"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: -1
  }
}
node {
  input: "27"
  output: "105"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "102"
  input: "105"
  input: "28"
  output: "107"
  op_type: "FC"
}
node {
  input: "107"
  output: "109"
  op_type: "Relu"
}
node {
  input: "109"
  output: "112"
  output: "113"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "29"
  output: "115"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "112"
  input: "115"
  input: "30"
  output: "117"
  op_type: "FC"
}
node {
  input: "117"
  output: "119"
  op_type: "Relu"
}
node {
  input: "119"
  output: "122"
  output: "123"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "31"
  output: "125"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "122"
  input: "125"
  input: "32"
  output: "127"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
output: "127"
