node {
  input: "53"
  input: "1"
  input: "2"
  output: "55"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "55"
  output: "57"
  op_type: "Relu"
}
node {
  input: "57"
  output: "59"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "59"
  input: "3"
  input: "4"
  output: "62"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "62"
  output: "64"
  op_type: "Relu"
}
node {
  input: "64"
  input: "5"
  input: "6"
  output: "66"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "66"
  output: "68"
  op_type: "Relu"
}
node {
  input: "64"
  input: "7"
  input: "8"
  output: "70"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "70"
  output: "72"
  op_type: "Relu"
}
node {
  input: "68"
  input: "72"
  output: "74"
  output: "tmp0"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "74"
  input: "9"
  input: "10"
  output: "76"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "76"
  output: "78"
  op_type: "Relu"
}
node {
  input: "78"
  input: "11"
  input: "12"
  output: "80"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "80"
  output: "82"
  op_type: "Relu"
}
node {
  input: "78"
  input: "13"
  input: "14"
  output: "84"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "84"
  output: "86"
  op_type: "Relu"
}
node {
  input: "82"
  input: "86"
  output: "88"
  output: "tmp1"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "88"
  output: "90"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "90"
  input: "15"
  input: "16"
  output: "93"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "93"
  output: "95"
  op_type: "Relu"
}
node {
  input: "95"
  input: "17"
  input: "18"
  output: "97"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "97"
  output: "99"
  op_type: "Relu"
}
node {
  input: "95"
  input: "19"
  input: "20"
  output: "101"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "101"
  output: "103"
  op_type: "Relu"
}
node {
  input: "99"
  input: "103"
  output: "105"
  output: "tmp2"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "105"
  input: "21"
  input: "22"
  output: "107"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "107"
  output: "109"
  op_type: "Relu"
}
node {
  input: "109"
  input: "23"
  input: "24"
  output: "111"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "111"
  output: "113"
  op_type: "Relu"
}
node {
  input: "109"
  input: "25"
  input: "26"
  output: "115"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "115"
  output: "117"
  op_type: "Relu"
}
node {
  input: "113"
  input: "117"
  output: "119"
  output: "tmp3"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "119"
  output: "121"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "121"
  input: "27"
  input: "28"
  output: "124"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "124"
  output: "126"
  op_type: "Relu"
}
node {
  input: "126"
  input: "29"
  input: "30"
  output: "128"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "128"
  output: "130"
  op_type: "Relu"
}
node {
  input: "126"
  input: "31"
  input: "32"
  output: "132"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "132"
  output: "134"
  op_type: "Relu"
}
node {
  input: "130"
  input: "134"
  output: "136"
  output: "tmp4"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "136"
  input: "33"
  input: "34"
  output: "138"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "138"
  output: "140"
  op_type: "Relu"
}
node {
  input: "140"
  input: "35"
  input: "36"
  output: "142"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "142"
  output: "144"
  op_type: "Relu"
}
node {
  input: "140"
  input: "37"
  input: "38"
  output: "146"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "146"
  output: "148"
  op_type: "Relu"
}
node {
  input: "144"
  input: "148"
  output: "150"
  output: "tmp5"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "150"
  input: "39"
  input: "40"
  output: "152"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "152"
  output: "154"
  op_type: "Relu"
}
node {
  input: "154"
  input: "41"
  input: "42"
  output: "156"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "156"
  output: "158"
  op_type: "Relu"
}
node {
  input: "154"
  input: "43"
  input: "44"
  output: "160"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "160"
  output: "162"
  op_type: "Relu"
}
node {
  input: "158"
  input: "162"
  output: "164"
  output: "tmp6"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "164"
  input: "45"
  input: "46"
  output: "166"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "166"
  output: "168"
  op_type: "Relu"
}
node {
  input: "168"
  input: "47"
  input: "48"
  output: "170"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "170"
  output: "172"
  op_type: "Relu"
}
node {
  input: "168"
  input: "49"
  input: "50"
  output: "174"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "174"
  output: "176"
  op_type: "Relu"
}
node {
  input: "172"
  input: "176"
  output: "178"
  output: "tmp7"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "178"
  output: "180"
  output: "tmp8"
  op_type: "Dropout"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "ratio"
    f: 0.5
  }
}
node {
  input: "180"
  input: "51"
  input: "52"
  output: "182"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "182"
  output: "184"
  op_type: "Relu"
}
node {
  input: "184"
  output: "186"
  op_type: "AveragePool"
  attribute {
    name: "kernel"
    i: 13
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "stride"
    i: 13
  }
}
node {
  input: "186"
  output: "188"
  output: "tmp9"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: 1000
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
input: "34"
input: "35"
input: "36"
input: "37"
input: "38"
input: "39"
input: "40"
input: "41"
input: "42"
input: "43"
input: "44"
input: "45"
input: "46"
input: "47"
input: "48"
input: "49"
input: "50"
input: "51"
input: "52"
input: "53"
output: "188"
