node {
  input: "17"
  input: "1"
  input: "2"
  output: "18"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 11
    ints: 11
  }
  attribute {
    name: "strides"
    ints: 4
    ints: 4
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "18"
  output: "19"
  op_type: "Relu"
}
node {
  input: "19"
  output: "20"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "20"
  input: "3"
  input: "4"
  output: "21"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 5
    ints: 5
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "21"
  output: "22"
  op_type: "Relu"
}
node {
  input: "22"
  output: "23"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "23"
  input: "5"
  input: "6"
  output: "24"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "24"
  output: "25"
  op_type: "Relu"
}
node {
  input: "25"
  input: "7"
  input: "8"
  output: "26"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "26"
  output: "27"
  op_type: "Relu"
}
node {
  input: "27"
  input: "9"
  input: "10"
  output: "28"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "28"
  output: "29"
  op_type: "Relu"
}
node {
  input: "29"
  output: "30"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "30"
  output: "32"
  output: "33"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: 9216
  }
}
node {
  input: "32"
  output: "35"
  output: "36"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "11"
  output: "37"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 1
    ints: 0
  }
}
node {
  input: "37"
  output: "38"
  op_type: "Transpose"
}
node {
  input: "35"
  input: "38"
  input: "12"
  output: "39"
  op_type: "FC"
}
node {
  input: "39"
  output: "40"
  op_type: "Relu"
}
node {
  input: "40"
  output: "42"
  output: "43"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "13"
  output: "44"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 1
    ints: 0
  }
}
node {
  input: "44"
  output: "45"
  op_type: "Transpose"
}
node {
  input: "42"
  input: "45"
  input: "14"
  output: "46"
  op_type: "FC"
}
node {
  input: "46"
  output: "47"
  op_type: "Relu"
}
node {
  input: "15"
  output: "48"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 1
    ints: 0
  }
}
node {
  input: "48"
  output: "49"
  op_type: "Transpose"
}
node {
  input: "47"
  input: "49"
  input: "16"
  output: "50"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
output: "50"
producer_version: 1
