node {
  input: "3"
  output: "4"
  op_type: "LeakyRelu"
  attribute {
    name: "alpha"
    f: 0.02
  }
}
node {
  input: "4"
  input: "1"
  input: "2"
  input: "saved_mean_3_0_8"
  input: "saved_var_3_0_9"
  output: "7"
  output: "saved_mean_3_0_8"
  output: "saved_var_3_0_9"
  output: "batch_norm_dead_output_12"
  output: "batch_norm_dead_output_13"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 1e-05
  }
  attribute {
    name: "order"
    s: "NCHW"
  }
  attribute {
    name: "momentum"
    f: 0.9
  }
}
node {
  input: "7"
  output: "15"
  op_type: "AveragePool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 1
  }
}
node {
  input: "15"
  output: "18"
  output: "19"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: -1
    ints: 1
  }
}
node {
  input: "18"
  output: "21"
  op_type: "Squeeze"
  attribute {
    name: "dims"
    ints: 1
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "saved_mean_3_0_8"
input: "saved_var_3_0_9"
output: "3"
