node {
  input: "53"
  input: "1"
  input: "2"
  output: "55"
  output: "56"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "55"
  output: "58"
  op_type: "Relu"
}
node {
  input: "58"
  output: "61"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "61"
  input: "3"
  input: "4"
  output: "65"
  output: "66"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "65"
  output: "68"
  op_type: "Relu"
}
node {
  input: "68"
  input: "5"
  input: "6"
  output: "71"
  output: "72"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "71"
  output: "74"
  op_type: "Relu"
}
node {
  input: "68"
  input: "7"
  input: "8"
  output: "77"
  output: "78"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "77"
  output: "80"
  op_type: "Relu"
}
node {
  input: "74"
  input: "80"
  output: "83"
  output: "tmp0"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "83"
  input: "9"
  input: "10"
  output: "86"
  output: "87"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "86"
  output: "89"
  op_type: "Relu"
}
node {
  input: "89"
  input: "11"
  input: "12"
  output: "92"
  output: "93"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "92"
  output: "95"
  op_type: "Relu"
}
node {
  input: "89"
  input: "13"
  input: "14"
  output: "98"
  output: "99"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "98"
  output: "101"
  op_type: "Relu"
}
node {
  input: "95"
  input: "101"
  output: "104"
  output: "tmp1"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "104"
  output: "107"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "107"
  input: "15"
  input: "16"
  output: "111"
  output: "112"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "111"
  output: "114"
  op_type: "Relu"
}
node {
  input: "114"
  input: "17"
  input: "18"
  output: "117"
  output: "118"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "117"
  output: "120"
  op_type: "Relu"
}
node {
  input: "114"
  input: "19"
  input: "20"
  output: "123"
  output: "124"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "123"
  output: "126"
  op_type: "Relu"
}
node {
  input: "120"
  input: "126"
  output: "129"
  output: "tmp2"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "129"
  input: "21"
  input: "22"
  output: "132"
  output: "133"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "132"
  output: "135"
  op_type: "Relu"
}
node {
  input: "135"
  input: "23"
  input: "24"
  output: "138"
  output: "139"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "138"
  output: "141"
  op_type: "Relu"
}
node {
  input: "135"
  input: "25"
  input: "26"
  output: "144"
  output: "145"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "144"
  output: "147"
  op_type: "Relu"
}
node {
  input: "141"
  input: "147"
  output: "150"
  output: "tmp3"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "150"
  output: "153"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "153"
  input: "27"
  input: "28"
  output: "157"
  output: "158"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "157"
  output: "160"
  op_type: "Relu"
}
node {
  input: "160"
  input: "29"
  input: "30"
  output: "163"
  output: "164"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "163"
  output: "166"
  op_type: "Relu"
}
node {
  input: "160"
  input: "31"
  input: "32"
  output: "169"
  output: "170"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "169"
  output: "172"
  op_type: "Relu"
}
node {
  input: "166"
  input: "172"
  output: "175"
  output: "tmp4"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "175"
  input: "33"
  input: "34"
  output: "178"
  output: "179"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "178"
  output: "181"
  op_type: "Relu"
}
node {
  input: "181"
  input: "35"
  input: "36"
  output: "184"
  output: "185"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "184"
  output: "187"
  op_type: "Relu"
}
node {
  input: "181"
  input: "37"
  input: "38"
  output: "190"
  output: "191"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "190"
  output: "193"
  op_type: "Relu"
}
node {
  input: "187"
  input: "193"
  output: "196"
  output: "tmp5"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "196"
  input: "39"
  input: "40"
  output: "199"
  output: "200"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "199"
  output: "202"
  op_type: "Relu"
}
node {
  input: "202"
  input: "41"
  input: "42"
  output: "205"
  output: "206"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "205"
  output: "208"
  op_type: "Relu"
}
node {
  input: "202"
  input: "43"
  input: "44"
  output: "211"
  output: "212"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "211"
  output: "214"
  op_type: "Relu"
}
node {
  input: "208"
  input: "214"
  output: "217"
  output: "tmp6"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "217"
  input: "45"
  input: "46"
  output: "220"
  output: "221"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "220"
  output: "223"
  op_type: "Relu"
}
node {
  input: "223"
  input: "47"
  input: "48"
  output: "226"
  output: "227"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "226"
  output: "229"
  op_type: "Relu"
}
node {
  input: "223"
  input: "49"
  input: "50"
  output: "232"
  output: "233"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "232"
  output: "235"
  op_type: "Relu"
}
node {
  input: "229"
  input: "235"
  output: "238"
  output: "tmp7"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "238"
  output: "241"
  output: "tmp8"
  op_type: "Dropout"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "ratio"
    f: 0.5
  }
}
node {
  input: "241"
  input: "51"
  input: "52"
  output: "244"
  output: "245"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "244"
  output: "247"
  op_type: "Relu"
}
node {
  input: "247"
  output: "250"
  op_type: "AveragePool"
  attribute {
    name: "kernel"
    i: 13
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "stride"
    i: 13
  }
}
node {
  input: "250"
  output: "253"
  output: "tmp9"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: 1000
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
input: "34"
input: "35"
input: "36"
input: "37"
input: "38"
input: "39"
input: "40"
input: "41"
input: "42"
input: "43"
input: "44"
input: "45"
input: "46"
input: "47"
input: "48"
input: "49"
input: "50"
input: "51"
input: "52"
input: "53"
output: "253"
