node {
  input: "17"
  input: "1"
  input: "2"
  output: "19"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 11
    ints: 11
  }
  attribute {
    name: "strides"
    ints: 4
    ints: 4
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "19"
  output: "22"
  op_type: "Relu"
}
node {
  input: "22"
  output: "25"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "25"
  input: "3"
  input: "4"
  output: "29"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 5
    ints: 5
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "29"
  output: "32"
  op_type: "Relu"
}
node {
  input: "32"
  output: "35"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "35"
  input: "5"
  input: "6"
  output: "39"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "39"
  output: "42"
  op_type: "Relu"
}
node {
  input: "42"
  input: "7"
  input: "8"
  output: "45"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "45"
  output: "48"
  op_type: "Relu"
}
node {
  input: "48"
  input: "9"
  input: "10"
  output: "51"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "51"
  output: "54"
  op_type: "Relu"
}
node {
  input: "54"
  output: "57"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "57"
  output: "61"
  output: "tmp0"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: 9216
  }
}
node {
  input: "61"
  output: "64"
  output: "tmp1"
  op_type: "Dropout"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "ratio"
    f: 0.5
  }
}
node {
  input: "11"
  output: "67"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "64"
  input: "67"
  input: "12"
  output: "70"
  op_type: "FC"
}
node {
  input: "70"
  output: "73"
  op_type: "Relu"
}
node {
  input: "73"
  output: "76"
  output: "tmp2"
  op_type: "Dropout"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "ratio"
    f: 0.5
  }
}
node {
  input: "13"
  output: "79"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "76"
  input: "79"
  input: "14"
  output: "82"
  op_type: "FC"
}
node {
  input: "82"
  output: "85"
  op_type: "Relu"
}
node {
  input: "15"
  output: "88"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "85"
  input: "88"
  input: "16"
  output: "91"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
output: "91"
