node {
  input: "9"
  input: "1"
  input: "2"
  output: "10"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 5
    ints: 5
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "10"
  output: "11"
  op_type: "Relu"
}
node {
  input: "11"
  input: "3"
  input: "4"
  output: "12"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "12"
  output: "13"
  op_type: "Relu"
}
node {
  input: "13"
  input: "5"
  input: "6"
  output: "14"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "14"
  output: "15"
  op_type: "Relu"
}
node {
  input: "15"
  input: "7"
  input: "8"
  output: "16"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "16"
  output: "18"
  output: "19"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: 1
    ints: 3
    ints: 3
    ints: 224
    ints: 224
  }
}
node {
  input: "18"
  output: "20"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
    ints: 4
    ints: 2
    ints: 5
    ints: 3
  }
}
node {
  input: "20"
  output: "22"
  output: "23"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: 1
    ints: 672
    ints: 672
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
output: "22"
producer_version: 1
