node {
  input: "17"
  input: "1"
  input: "2"
  output: "18"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 11
    ints: 11
  }
  attribute {
    name: "strides"
    ints: 4
    ints: 4
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "18"
  output: "20"
  op_type: "Relu"
}
node {
  input: "20"
  output: "22"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "22"
  input: "3"
  input: "4"
  output: "25"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 5
    ints: 5
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "25"
  output: "27"
  op_type: "Relu"
}
node {
  input: "27"
  output: "29"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "29"
  input: "5"
  input: "6"
  output: "32"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "32"
  output: "34"
  op_type: "Relu"
}
node {
  input: "34"
  input: "7"
  input: "8"
  output: "36"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "36"
  output: "38"
  op_type: "Relu"
}
node {
  input: "38"
  input: "9"
  input: "10"
  output: "40"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "40"
  output: "42"
  op_type: "Relu"
}
node {
  input: "42"
  output: "44"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "44"
  output: "48"
  output: "49"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: 9216
  }
}
node {
  input: "48"
  output: "52"
  output: "53"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "11"
  output: "55"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "52"
  input: "55"
  input: "12"
  output: "57"
  op_type: "FC"
}
node {
  input: "57"
  output: "59"
  op_type: "Relu"
}
node {
  input: "59"
  output: "62"
  output: "63"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "13"
  output: "65"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "62"
  input: "65"
  input: "14"
  output: "67"
  op_type: "FC"
}
node {
  input: "67"
  output: "69"
  op_type: "Relu"
}
node {
  input: "15"
  output: "71"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "69"
  input: "71"
  input: "16"
  output: "73"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
output: "73"
