node {
  input: "53"
  input: "1"
  input: "2"
  output: "54"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "54"
  output: "56"
  op_type: "Relu"
}
node {
  input: "56"
  output: "58"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "58"
  input: "3"
  input: "4"
  output: "61"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "61"
  output: "63"
  op_type: "Relu"
}
node {
  input: "63"
  input: "5"
  input: "6"
  output: "65"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "65"
  output: "67"
  op_type: "Relu"
}
node {
  input: "63"
  input: "7"
  input: "8"
  output: "69"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "69"
  output: "71"
  op_type: "Relu"
}
node {
  input: "67"
  input: "71"
  output: "74"
  output: "75"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "74"
  input: "9"
  input: "10"
  output: "77"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "77"
  output: "79"
  op_type: "Relu"
}
node {
  input: "79"
  input: "11"
  input: "12"
  output: "81"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "81"
  output: "83"
  op_type: "Relu"
}
node {
  input: "79"
  input: "13"
  input: "14"
  output: "85"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "85"
  output: "87"
  op_type: "Relu"
}
node {
  input: "83"
  input: "87"
  output: "90"
  output: "91"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "90"
  output: "93"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "93"
  input: "15"
  input: "16"
  output: "96"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "96"
  output: "98"
  op_type: "Relu"
}
node {
  input: "98"
  input: "17"
  input: "18"
  output: "100"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "100"
  output: "102"
  op_type: "Relu"
}
node {
  input: "98"
  input: "19"
  input: "20"
  output: "104"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "104"
  output: "106"
  op_type: "Relu"
}
node {
  input: "102"
  input: "106"
  output: "109"
  output: "110"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "109"
  input: "21"
  input: "22"
  output: "112"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "112"
  output: "114"
  op_type: "Relu"
}
node {
  input: "114"
  input: "23"
  input: "24"
  output: "116"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "116"
  output: "118"
  op_type: "Relu"
}
node {
  input: "114"
  input: "25"
  input: "26"
  output: "120"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "120"
  output: "122"
  op_type: "Relu"
}
node {
  input: "118"
  input: "122"
  output: "125"
  output: "126"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "125"
  output: "128"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "128"
  input: "27"
  input: "28"
  output: "131"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "131"
  output: "133"
  op_type: "Relu"
}
node {
  input: "133"
  input: "29"
  input: "30"
  output: "135"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "135"
  output: "137"
  op_type: "Relu"
}
node {
  input: "133"
  input: "31"
  input: "32"
  output: "139"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "139"
  output: "141"
  op_type: "Relu"
}
node {
  input: "137"
  input: "141"
  output: "144"
  output: "145"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "144"
  input: "33"
  input: "34"
  output: "147"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "147"
  output: "149"
  op_type: "Relu"
}
node {
  input: "149"
  input: "35"
  input: "36"
  output: "151"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "151"
  output: "153"
  op_type: "Relu"
}
node {
  input: "149"
  input: "37"
  input: "38"
  output: "155"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "155"
  output: "157"
  op_type: "Relu"
}
node {
  input: "153"
  input: "157"
  output: "160"
  output: "161"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "160"
  input: "39"
  input: "40"
  output: "163"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "163"
  output: "165"
  op_type: "Relu"
}
node {
  input: "165"
  input: "41"
  input: "42"
  output: "167"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "167"
  output: "169"
  op_type: "Relu"
}
node {
  input: "165"
  input: "43"
  input: "44"
  output: "171"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "171"
  output: "173"
  op_type: "Relu"
}
node {
  input: "169"
  input: "173"
  output: "176"
  output: "177"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "176"
  input: "45"
  input: "46"
  output: "179"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "179"
  output: "181"
  op_type: "Relu"
}
node {
  input: "181"
  input: "47"
  input: "48"
  output: "183"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "183"
  output: "185"
  op_type: "Relu"
}
node {
  input: "181"
  input: "49"
  input: "50"
  output: "187"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "187"
  output: "189"
  op_type: "Relu"
}
node {
  input: "185"
  input: "189"
  output: "192"
  output: "193"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "192"
  output: "196"
  output: "197"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "196"
  input: "51"
  input: "52"
  output: "199"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "199"
  output: "201"
  op_type: "Relu"
}
node {
  input: "201"
  output: "203"
  op_type: "AveragePool"
  attribute {
    name: "kernel"
    i: 13
  }
  attribute {
    name: "stride"
    i: 13
  }
  attribute {
    name: "pad"
    i: 0
  }
}
node {
  input: "203"
  output: "206"
  output: "207"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: 1000
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
input: "34"
input: "35"
input: "36"
input: "37"
input: "38"
input: "39"
input: "40"
input: "41"
input: "42"
input: "43"
input: "44"
input: "45"
input: "46"
input: "47"
input: "48"
input: "49"
input: "50"
input: "51"
input: "52"
input: "53"
output: "206"
