node {
  input: "33"
  input: "1"
  input: "2"
  output: "35"
  output: "36"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "35"
  output: "38"
  op_type: "Relu"
}
node {
  input: "38"
  input: "3"
  input: "4"
  output: "41"
  output: "42"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "41"
  output: "44"
  op_type: "Relu"
}
node {
  input: "44"
  output: "47"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "47"
  input: "5"
  input: "6"
  output: "51"
  output: "52"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "51"
  output: "54"
  op_type: "Relu"
}
node {
  input: "54"
  input: "7"
  input: "8"
  output: "57"
  output: "58"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "57"
  output: "60"
  op_type: "Relu"
}
node {
  input: "60"
  output: "63"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "63"
  input: "9"
  input: "10"
  output: "67"
  output: "68"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "67"
  output: "70"
  op_type: "Relu"
}
node {
  input: "70"
  input: "11"
  input: "12"
  output: "73"
  output: "74"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "73"
  output: "76"
  op_type: "Relu"
}
node {
  input: "76"
  input: "13"
  input: "14"
  output: "79"
  output: "80"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "79"
  output: "82"
  op_type: "Relu"
}
node {
  input: "82"
  output: "85"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "85"
  input: "15"
  input: "16"
  output: "89"
  output: "90"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "89"
  output: "92"
  op_type: "Relu"
}
node {
  input: "92"
  input: "17"
  input: "18"
  output: "95"
  output: "96"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "95"
  output: "98"
  op_type: "Relu"
}
node {
  input: "98"
  input: "19"
  input: "20"
  output: "101"
  output: "102"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "101"
  output: "104"
  op_type: "Relu"
}
node {
  input: "104"
  output: "107"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "107"
  input: "21"
  input: "22"
  output: "111"
  output: "112"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "111"
  output: "114"
  op_type: "Relu"
}
node {
  input: "114"
  input: "23"
  input: "24"
  output: "117"
  output: "118"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "117"
  output: "120"
  op_type: "Relu"
}
node {
  input: "120"
  input: "25"
  input: "26"
  output: "123"
  output: "124"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "123"
  output: "126"
  op_type: "Relu"
}
node {
  input: "126"
  output: "129"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
  attribute {
    name: "stride"
    i: 2
  }
}
node {
  input: "129"
  output: "133"
  output: "tmp0"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: -1
  }
}
node {
  input: "27"
  output: "136"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "133"
  input: "136"
  input: "28"
  output: "139"
  op_type: "FC"
}
node {
  input: "139"
  output: "142"
  op_type: "Relu"
}
node {
  input: "142"
  output: "145"
  output: "tmp1"
  op_type: "Dropout"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "ratio"
    f: 0.5
  }
}
node {
  input: "29"
  output: "148"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "145"
  input: "148"
  input: "30"
  output: "151"
  op_type: "FC"
}
node {
  input: "151"
  output: "154"
  op_type: "Relu"
}
node {
  input: "154"
  output: "157"
  output: "tmp2"
  op_type: "Dropout"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "ratio"
    f: 0.5
  }
}
node {
  input: "31"
  output: "160"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "157"
  input: "160"
  input: "32"
  output: "163"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
output: "163"
